In [1]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [2]:
us_weather = pd.DataFrame({
    "city": ["washington","sanfransisco","chicago"],
    "temperature": [34,42,30],
    "humidity": [60, 70, 68]
})
us_weather

           city  temperature  humidity
0    washington           34        60
1  sanfransisco           42        70
2       chicago           30        68

In [10]:
df = pd.concat([india_weather,us_weather])
df

           city  temperature  humidity
0        mumbai           32        80
1         delhi           45        60
2      banglore           30        78
0    washington           34        60
1  sanfransisco           42        70
2       chicago           30        68

In [16]:
df =pd.concat([india_weather, us_weather], ignore_index=True) ##ignoring index
df

           city  temperature  humidity
0        mumbai           32        80
1         delhi           45        60
2      banglore           30        78
3    washington           34        60
4  sanfransisco           42        70
5       chicago           30        68

In [17]:
df =pd.concat([india_weather, us_weather], keys=['india','us'])##concatenation and keys
df

                 city  temperature  humidity
india 0        mumbai           32        80
      1         delhi           45        60
      2      banglore           30        78
us    0    washington           34        60
      1  sanfransisco           42        70
      2       chicago           30        68

In [19]:
df.loc['india']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [20]:
df.loc['us']

           city  temperature  humidity
0    washington           34        60
1  sanfransisco           42        70
2       chicago           30        68

#concatenation using index

In [38]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
},index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [41]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
},index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [42]:
df=pd.concat([temperature_df ,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

#conacanate dataframe with series

In [43]:
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [46]:
df=pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain